app/controllers/posts_controller.rb

    def index
        @posts = Post.all
---
SELECT "posts".* FROM "posts" ORDER BY published_at DESC

    def create
        @post = Post.new(post_params)
        @post.user_id = current_user.id
        respond_to do |format|
            if @post.save
---
INSERT INTO "posts" ("title", "description", "name", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["title", "sdfdsf"], ["description", "sdfsdfasfdasdsa"], ["name", "sdfsdfsd"], ["created_at", "2023-01-31 04:23:58.021767"], ["updated_at", "2023-01-31 04:23:58.021767"], ["user_id", 1]]

    def destroy
        # only the user who created the post can delete it
        if @post.user_id == current_user.id
            @post.destroy
---
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 2]]